In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
# !ls ../homework

In [6]:
df = pd.read_csv('../homework/demo_duplicate.csv')

In [8]:
del df['Unnamed: 0']

In [10]:
df.size

15956

In [11]:
len(df)

3989

In [12]:
len(df['Seqno'].unique())

1000

In [13]:
df.head(10)

    Price  Seqno Symbol        time
0  1623.0    0.0   APPL  1473411962
1  1623.0    0.0   APPL  1473411962
2  1623.0    0.0   APPL  1473411963
3  1623.0    0.0   APPL  1473411963
4  1649.0    1.0   APPL  1473411963
5  1649.0    1.0   APPL  1473411963
6  1649.0    1.0   APPL  1473411964
7  1649.0    1.0   APPL  1473411964
8  1642.0    2.0   APPL  1473411964
9  1642.0    2.0   APPL  1473411964

In [14]:
df['Seqno'].duplicated()

0       False
1        True
2        True
3        True
4       False
        ...
3984     True
3985    False
3986     True
3987     True
3988     True
Name: Seqno, Length: 3989, dtype: bool

In [15]:
df.drop_duplicates(['Seqno'],keep='first')

       Price  Seqno Symbol        time
0     1623.0    0.0   APPL  1473411962
4     1649.0    1.0   APPL  1473411963
8     1642.0    2.0   APPL  1473411964
12    1636.0    3.0   APPL  1473411965
16    1669.0    4.0   APPL  1473411966
...      ...    ...    ...         ...
3969  1641.0  995.0   APPL  1473412957
3973  1581.0  996.0   APPL  1473412958
3977  1674.0  997.0   APPL  1473412959
3981  1680.0  998.0   APPL  1473412960
3985  1509.0  999.0   APPL  1473412961

[1000 rows x 4 columns]

In [20]:
df.head()

    Price  Seqno Symbol        time
0  1623.0    0.0   APPL  1473411962
1  1623.0    0.0   APPL  1473411962
2  1623.0    0.0   APPL  1473411963
3  1623.0    0.0   APPL  1473411963
4  1649.0    1.0   APPL  1473411963

# 如何对dataframe中的数据做去重操作，duplicated查看是否重复，drop_duplicates去掉重复的列